In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%%sql
use world

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [12]:
%%sql
DROP Table CustomerData;

CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '9876', 'Chennai', 5000.00),
(2, 'Priya', NULL, '9876', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '9876', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
5 rows affected.

[]